zapisy.dodajProwadzacego.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:z1="localhost/zapisy.wsdl">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <z1:dodajProwadzacego>
   <daneProwadzacego>
    <email></email>
    <imie></imie>
    <nazwisko></nazwisko>
    <haslo></haslo>
    <admin>false</admin>
   </daneProwadzacego>
  </z1:dodajProwadzacego>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
